package ru.itmo.se.programming.p3114.s311734;

import ru.itmo.se.programming.p3114.s311734.humans.Human;
import ru.itmo.se.programming.p3114.s311734.humans.somePeople;

public class Main {
    public static void main(String[] args) {
        somePeople people  = new somePeople();
        System.out.println(people.getCount());
        System.out.println(people.getHuman(people.getCount()-1).getName());
/*
Кто-то очень охотно покупал акции.
Акции покупали жители Давилона и приезжие из других городов.
Акциями интересуются все, кроме крупных богачей, уверенных что Общество гигантских растений -- это обычное акционерное общество, которое вскорости лопнет и прекратит свое существование.
Богачам известно, что все акционерные общества и компании устраивались лишь для прикарманивания чужих денег ( = облапошивания бедняков).
Господин Спрутс – типичный представитель богатейших жителей города Грабенберга, не отличающиеся большой красотой – объявился и заинтересовался гигантскими акциями.
У Спрутса было широковатое лицо с малюсенькими глазками, словно гвоздики, и чрезвычайно тоненьким, зажатым между двумя пухлыми щечками носиком.
Благодаря ширине лица и некоторой припухлости щек казалось, будто господин Спрутс постоянно улыбается, и это придавало ему смешной вид.
Никто не думал смеяться над ним.
Каждый, кто разговаривал с господином Спрутсом, думал исключительно о его богатстве.

 */
    }
}
